a_1=int(input("ВВедите абсциссу точки A: ")

b_1=int(input("Введите ординату точки A: ")

a_2=int(input("ВВедите абсциссу точки B: ")

b_2=int(input("Введите ординату точки B: ")

a_3=int(input("ВВедите абсциссу точки C: ")

b_3=int(input("Введите ординату точки C: ")

a_4=int(input("ВВедите абсциссу точки D: ")

b_4=int(input("Введите ординату точки D: ")

if abs(a_1-a_2)=abs(a_3-a_4):
    if abs(b_1-b_2)=abs(b_3-b_4):
        print("Это параллелограмм")
elif abs(a_1 - a_3) = abs(a_2 - a_4)):
    if abs(b_1 - b_3) = abs(b_2 - b_4)
        print("Это параллелограмм")
else:
    print("Это не параллелограмм")